trade_exp/src/Catalogs/ЗоныДоступа/ЗоныДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6057ce36-db86-4d6d-be98-f712e6f80a51">
  <name>ЗоныДоступа</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="c71979d7-8f64-475f-9e8c-383889c9b44c">
    <name>Датчики</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="dc5c0612-6a92-4bc8-9fac-dd890118f7b4">
      <name>Датчик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/ЗоныДоступа/ObjectModule.bsl
&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтотОбъект.ПометкаУдаления Тогда 
		ДатчикиСКУД = ПроверитьПрисутствиеДатчикаВДругихЗонах(Датчики.ВыгрузитьКолонку("Датчик"), Ссылка);
		Если ДатчикиСКУД.Количество() > 0 Тогда
			Для Каждого Стр Из ДатчикиСКУД Цикл
				Сообщить("Датчик: " + Стр.Датчик + " присутствует в другой зоне");
			КонецЦикла;
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьПрисутствиеДатчикаВДругихЗонах(Датчики, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗоныДоступаДатчики.Датчик КАК Датчик,
	|	ЗоныДоступаДатчики.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЗоныДоступа.Датчики КАК ЗоныДоступаДатчики
	|ГДЕ
	|	НЕ ЗоныДоступаДатчики.Ссылка.ПометкаУдаления
	|	И ЗоныДоступаДатчики.Датчик В(&Датчики)
	|	И ЗоныДоступаДатчики.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Датчики", Датчики);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции
